app/Controllers/Api/CourseController.php

SELECT *
FROM `course`
WHERE `title` LIKE '%title%' ESCAPE '!'
ORDER BY `course_id` DESC
---
    public function find($key = null)
    {
        $model = new Course();
        $data = $model->orderBy('course_id', 'DESC')->like('title', $key)->find();