app/Controllers/CourseController.php

SELECT *
FROM `course`
ORDER BY `course_id` DESC
---
    public function index()
    {
        $model = new Course();
        $data = $model->orderBy('course_id', 'DESC')->findAll();

SELECT *
FROM `course`
WHERE `course`.`course_id` = '3'
---
    public function update($id = null)
    {
        $model = new Course();

        $rules = [
            'title' => 'required|min_length[8]',
            'description' => 'required|min_length[8]',
            'price' => 'required|numeric',
        ];

        $messages = [
            "title" => [
                "required" => "Kolom {field} harus di isi"
            ],
            "description" => [
                "required" => "Kolom {field} harus di isi"
            ],
            "price" => [
                "required" => "Kolom {field} harus di isi"
            ],
        ];

        $response;
        if($model->find($id)){

SELECT *
FROM `course`
WHERE `course`.`course_id` = '2'
DELETE FROM `course`
WHERE `course_id` IN ('2')
---
    public function delete($id = null)
    {
        $model = new Course();

        if($model->find($id)){
            $model->delete($id);

SELECT *
FROM `course`
WHERE `title` LIKE '%jud%' ESCAPE '!'
ORDER BY `course_id` DESC
---
    public function find($key = null)
    {
        $model = new Course();
        $data = $model->orderBy('course_id', 'DESC')->like('title', $key)->find();