app/Controllers/CourseController.php

SELECT *
FROM `course`
WHERE `course`.`course_id` = '2'
SELECT *
FROM `course`
WHERE `course_id` = '2'
 LIMIT 1
---
    public function show($id = null)
    {
        $model = new Course();

        if($model->find($id)){
            $data = $model->where('course_id', $id)->first();

INSERT INTO `course` (`title`, `description`, `price`) VALUES ('Judul course 1', 'Deskripsi course 1', '100000')
---
    public function create()
    {
        $model = new Course();

        $rules = [
            'title' => 'required|min_length[8]',
            'description' => 'required|min_length[8]',
            'price' => 'required|numeric',
        ];

        $response;
        if($this->validate($rules)) {
            $data = [
              'title' => $this->request->getVar('title'),
              'description' => $this->request->getVar('description'),
              'price' => $this->request->getVar('price')
            ];

            $model->insert($data);

SELECT *
FROM `course`
WHERE `course`.`course_id` = '2'
UPDATE `course` SET `title` = 'Ubah judul course 1', `description` = 'Ubah deskripsi course 1', `price` = '99999'
WHERE `course`.`course_id` IN ('2')
---
    public function update($id = null)
    {
        $model = new Course();

        $rules = [
            'title' => 'required|min_length[8]',
            'description' => 'required|min_length[8]',
            'price' => 'required|numeric',
        ];

        $response;
        if($model->find($id)){
            if($this->validate($rules)) {
                $data = [
                  'title' => $this->request->getRawInput('title'),
                  'description' => $this->request->getRawInput('description'),
                  'price' => $this->request->getRawInput('price')
                ];

                $model->update($id, $data['title']);

SELECT *
FROM `course`
WHERE `course`.`course_id` = '1'
DELETE FROM `course`
WHERE `course_id` IN ('1')
---
    public function delete($id = null)
    {
        $model = new Course();

        if($model->find($id)){
            $model->delete($id);

SELECT *
FROM `course`
WHERE `title` LIKE '%%' ESCAPE '!'
ORDER BY `course_id` DESC
---
    public function index($total = 4)
    {
        $model = new Course();

        // $data = $model->orderBy('course_id', 'DESC')->limit($total)->find();
        $data = $model->orderBy('course_id', 'DESC')->like('title', 'u')->find();