app/Controllers/PolicyAndPrivacyController.php

SELECT *
FROM `policy_and_privacy`
ORDER BY `pap_id` DESC
---
    public function index()
    {
        $model = new PolicyAndPrivacy();
        $data = $model->orderBy('pap_id', 'DESC')->findAll();

SELECT *
FROM `policy_and_privacy`
WHERE `pap_id` = '1'
 LIMIT 1
---
    public function show($id = null)
    {
        $model = new PolicyAndPrivacy();

        if($model->find($id)){
            $data = $model->where('pap_id', $id)->first();

INSERT INTO `policy_and_privacy` (`value`) VALUES ('ini value bang')
---
    public function create()
    {
        $model = new PolicyAndPrivacy();

        $rules = [
            'value' => 'required|min_length[8]',
        ];

        $response;
        if($this->validate($rules)) {
            $data = [
              'value' => $this->request->getVar('value')
            ];

            $model->insert($data);

UPDATE `policy_and_privacy` SET `value` = ('ubah data')
WHERE `policy_and_privacy`.`pap_id` IN ('4')
---
    public function update($id = null)
    {
        $model = new PolicyAndPrivacy();

        $rules = [
            'value' => 'required|min_length[8]',
        ];

        $messages = [
            "value" => [
                "required" => "Kolom {field} harus di isi"
            ],
        ];

        $response;
        if($model->find($id)){
            if($this->validate($rules, $messages)) {
                $data = [
                  'value' => $this->request->getRawInput('value')
                ];

                $model->update($id, $data);